# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here

import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [9]:
cur.execute("""SELECT lastName, firstName FROM employees
                        JOIN offices
                        ON employees.officeCode = offices.officeCode
                        WHERE city = 'Boston';
""").fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [11]:
#Your code here

cur.execute("""SELECT city,
                    COUNT(*)
                    FROM offices
                    JOIN employees
                    USING(officeCode)
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [14]:
# Answers will vary
# What is the price of each product name?

cur.execute("""SELECT products.productName,orderdetails.priceEach
                    FROM products
                    JOIN orderDetails
                    USING(productCode)
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

                                     0       1
0  18th Century Vintage Horse Carriage   98.44
1                18th century schooner   99.54
2               1900s Vintage Bi-Plane   67.82
3              1900s Vintage Tri-Plane   72.45
4                    1903 Ford Model A  136.59

In [21]:
# Your code here

# What is the quantity each customer ordered by order date?

cur.execute("""SELECT customers.customerName, orderdetails.quantityOrdered, orders.orderDate 
                    FROM customers
                    JOIN orders
                    USING (customerNumber)
                    JOIN orderdetails
                    USING orderNumber
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

OperationalError: near "orderNumber": syntax error

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

cur.execute("""SELECT products.productName,orderdetails.priceEach
                    FROM products
                    JOIN orderDetails
                    USING(productCode)
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!